atsam-rs/atsam-pac/svd/ATSAM4EC.svd
        <register>
          <name>BFT64</name>
          <description>64 Byte Frames Transmitted Register</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFTX</name>
              <description>64 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFT127</name>
          <description>65 to 127 Byte Frames Transmitted Register</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFTX</name>
              <description>65 to 127 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFT255</name>
          <description>128 to 255 Byte Frames Transmitted Register</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFTX</name>
              <description>128 to 255 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFT511</name>
          <description>256 to 511 Byte Frames Transmitted Register</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFTX</name>
              <description>256 to 511 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFT1023</name>
          <description>512 to 1023 Byte Frames Transmitted Register</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFTX</name>
              <description>512 to 1023 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFT1518</name>
          <description>1024 to 1518 Byte Frames Transmitted Register</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFTX</name>
              <description>1024 to 1518 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTBFT1518</name>
          <description>Greater Than 1518 Byte Frames Transmitted Register</description>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFTX</name>
              <description>Greater than 1518 Byte Frames Transmitted without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TUR</name>
          <description>Transmit Underruns Register</description>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXUNR</name>
              <description>Transmit Underruns</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCF</name>
          <description>Single Collision Frames Register</description>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCOL</name>
              <description>Single Collision</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCF</name>
          <description>Multiple Collision Frames Register</description>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCOL</name>
              <description>Multiple Collision</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EC</name>
          <description>Excessive Collisions Register</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XCOL</name>
              <description>Excessive Collisions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LC</name>
          <description>Late Collisions Register</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LCOL</name>
              <description>Late Collisions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTF</name>
          <description>Deferred Transmission Frames Register</description>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DEFT</name>
              <description>Deferred Transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSE</name>
          <description>Carrier Sense Errors Register</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CSR</name>
              <description>Carrier Sense Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ORLO</name>
          <description>Octets Received [31:0] Received</description>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXO</name>
              <description>Received Octets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ORHI</name>
          <description>Octets Received [47:32] Received</description>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXO</name>
              <description>Received Octets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <description>Frames Received Register</description>
          <addressOffset>0x00000158</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRX</name>
              <description>Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCFR</name>
          <description>Broadcast Frames Received Register</description>
          <addressOffset>0x0000015C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BFRX</name>
              <description>Broadcast Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MFR</name>
          <description>Multicast Frames Received Register</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MFRX</name>
              <description>Multicast Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PFR</name>
          <description>Pause Frames Received Register</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PFRX</name>
              <description>Pause Frames Received Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BFR64</name>
          <description>64 Byte Frames Received Register</description>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFRX</name>
              <description>64 Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFR127</name>
          <description>65 to 127 Byte Frames Received Register</description>
          <addressOffset>0x0000016C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFRX</name>
              <description>65 to 127 Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFR255</name>
          <description>128 to 255 Byte Frames Received Register</description>
          <addressOffset>0x00000170</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFRX</name>
              <description>128 to 255 Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFR511</name>
          <description>256 to 511Byte Frames Received Register</description>
          <addressOffset>0x00000174</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFRX</name>
              <description>256 to 511 Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFR1023</name>
          <description>512 to 1023 Byte Frames Received Register</description>
          <addressOffset>0x00000178</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFRX</name>
              <description>512 to 1023 Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFR1518</name>
          <description>1024 to 1518 Byte Frames Received Register</description>
          <addressOffset>0x0000017C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFRX</name>
              <description>1024 to 1518 Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TMXBFR</name>
          <description>1519 to Maximum Byte Frames Received Register</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFRX</name>
              <description>1519 to Maximum Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UFR</name>
          <description>Undersize Frames Received Register</description>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UFRX</name>
              <description>Undersize Frames Received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR</name>
          <description>Oversize Frames Received Register</description>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFRX</name>
              <description>Oversized Frames Received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JR</name>
          <description>Jabbers Received Register</description>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JRX</name>
              <description>Jabbers Received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCSE</name>
          <description>Frame Check Sequence Errors Register</description>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FCKR</name>
              <description>Frame Check Sequence Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFFE</name>
          <description>Length Field Frame Errors Register</description>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LFER</name>
              <description>Length Field Frame Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSE</name>
          <description>Receive Symbol Errors Register</description>
          <addressOffset>0x00000198</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXSE</name>
              <description>Receive Symbol Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AE</name>
          <description>Alignment Errors Register</description>
          <addressOffset>0x0000019C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AER</name>
              <description>Alignment Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RRE</name>
          <description>Receive Resource Errors Register</description>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXRER</name>
              <description>Receive Resource Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROE</name>
          <description>Receive Overrun Register</description>
          <addressOffset>0x000001A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXOVR</name>
              <description>Receive Overruns</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IHCE</name>
          <description>IP Header Checksum Errors Register</description>
          <addressOffset>0x000001A8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HCKER</name>
              <description>IP Header Checksum Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCE</name>
          <description>TCP Checksum Errors Register</description>
          <addressOffset>0x000001AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCKER</name>
              <description>TCP Checksum Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
